PROCEDURE DIVISION.

    MOVE WS-DATA-FIELD1 TO DB-RECORD-FIELD1.
    MOVE WS-DATA-FIELD2 TO DB-RECORD-FIELD2.
    MOVE WS-DATA-FIELD3 TO DB-RECORD-FIELD3.
    ...

    * Explicitly move each field to handle potential mismatches.

END PROGRAM.